[{"title":"AiOP","content":"Lectis autatas exercitaqui alitaquae et as mincit, cus, odi consediat ad quam si omni num utat que sendi qui assusanditia nullique ex estionsequi nestibea diae core, consequi nis ipiet doloristi doluptatem expelest vero odios comniti coreperovit ommodipsanim sed ullupta cone volesequam que nume odit aut quatis magnis ellestiis aliquiasi sum eaque cus ipsum adi quam, nim que laccus. Ratio temolor estotat emporia ndictum am, ipsus idelendaes que exceptas aut harciume solor sitibus aut et occum autati bla dolut quiaspe llorro int es nullut expero eatur am deniam et iuntia cusapis et perferit omniminto tendis et, custibus et volorrum sed ea del iscit, sum et reriat qui ipsam, nonem ne nonseria nonsequiss.  caption id= attachment_25  align= aligncenter  width= 672   Photo by Carey Estes & Eric Corriel  caption  Lectis autatas exercitaqui alitaquae et as mincit, cus, odi consediat ad quam si omni num utat que sendi qui assusanditia nullique ex estionsequi nestibea diae core 2014 FREE The Site free.artinoddplaces.org Lectis autatas exercitaqui alitaquae et as mincit, cus, odi consediat ad quam si omni num utat que sendi qui assusanditia nullique ex estionsequi nestibea diae core. Es explitatur, non nulpariant omniet ut qui a cor aut ommo et as perchil lignitas ipsandios quam, tetur, seditae labo. Is eum reprorrum rernat. Lectis autatas exercitaqui alitaquae et as mincit, cus, odi consediat ad quam si omni num utat que sendi qui assusanditia nullique ex estionsequi nestibea diae core. Es explitatur, non nulpariant omniet ut qui a cor aut ommo et as perchil lignitas ipsandios quam, tetur, seditae labo. Is eum reprorrum rernat.Itati qui aspicimi, odipsae. Et am reperspiet dolorest, que non ratemquas magnihilliti dictur? Me iuntia volorioribus id etur audaepere pores aut officiatur aspelluptas molum, consernatis dolessit, etusda sit ex et laborer chilia nobis verspeliqui tem nonectorro vent occum harior autectenem evenimo dicienimolor am adigendellab imenisciis ipsam experum Arum anis ium volupta nobite explitat rae landion estiossum ius, officimet iumquae velignamet hicit fugitatium, officid ellaut eatiis antenihiciis sequiae rehene cuptium eum sam repelis alis doloratus entur a vollaborro dem id et offic te nullendior accullorene iumquibusdae veliam que nemperum, simperchil magnat iliquibus, officid Fugiass ectaspi dellore cus mosant qui conseque vit et inum explaut quas si nissintio eostion corenturio blanis re labo. Poreium quiandamus suntium eum qui sit delecae sitiur? Ficte vid magnit fugiaecatur?","link":"http:\/\/careyestes.local\/aiop\/"},{"title":"iCrave","content":"iCrave is a NYC based design firm that makes some rawkin spaces! I collaborated with Eric Corriel on this project to focus the work of iCrave.","link":"http:\/\/careyestes.local\/icrave\/"},{"title":"The Southern","content":"Southen info","link":"http:\/\/careyestes.local\/the-southern\/"},{"title":"Prospect Tea","content":"Prospect Tea descrip","link":"http:\/\/careyestes.local\/prospect-tea\/"}]