[{"title":"Resume","content":"NOTE   I am currently migrating data from my old site to the new one. This will be all nice and styled soon. In the meantime, check out my resume here, or contact me for any documents you need. Code   Software   Web Skillset html5   CSS3   PHP    Wordpress   Symfony 1 & 2   Laravel    Git   Gulp Grunt   Javascript   Jquery   Sass   Bootstrap   Sendgrid   Actionscript 3.0   w3c Standards   Sublime Text   Photoshop    Dreamweaver   Flash     Illustrator    InDesign   After Effects     Word    Excel    Powerpoint    Premiere    Autodesk Maya Education 2008   Master of Science & Architecture   Emphasis in Electronic Visualization Mississippi State University 2006   Bachelor of Fine Arts   Emphasis in Graphic Design Mississippi State University Professional Work June   2014     Present University of Tennessee (UT)   Interactive Art Director Web Work  studentsuccess.utk.edu parking.utk.edu honors.utk.edu utk.edu maps Using  PHP 5.4 Jquery CSS3 Git Gulp npm Software  Photoshop Illustrator Sublime Text Taught web team how to use Git in a version controlled team environment Incorporated Git into the web team workflow Researched and chose a Laravel framework for new utk.edu development Began development of new utk.edu design in Laravel framework as a proof of concept Added Typeahead to numerous applications on utk.edu Updated Google Maps functionality on utk.edu Created The Oracle, a centralized hub of info for the web team Wrote documentation to support the web team using Git Helped redesign and develop a new ut theme Designed and developed some fancy .js scripts for accordions and tabs for direct linking (#hash links) Designed and developed responsive tabs for the Wordpress ut-responsive theme Developed a Typeahead search method for querying data by page title and content Took over managing Provost and Haslam newsletters Took over admin for Events calendar. Extensive research on the best way to manage the events calendar on relaunch. Helped with Asset Bank, Digital Asset Management software, setup and organization January   2012     Present School of Visual Arts (SVA)   Multimedia Developer Web Work  sva.edu vap.sva.edu training ceblog.sva.edu blog.sva.edu insider.sva.edu learning.sva.edu strategicplan.sva.edu macp.sva.edu Using  Symfony 1.4   Symfony2 Wordpress PHP 5.4 Jquery SASS CSS2 & CSS3 Git Software  Photoshop Illustrator Sublime Text Created a custom LDAP login system for CMS users Designed & developed a Newsletter module for the SVA Communications to create, edit, and  distribute the SVA monthly newsletter through the CMS and Sendgrid. Created all videos and tutorials for vap.sva.edu training to help users with the sva.edu CMS. Designed and developed the Events page layout for sva.edu events Developed the videos gallery for sva.edu videos May   2010     January   2012 Tri-State Surgical Supply   Senior Graphic Designer   Developer Web Work  sterexmedical.com Language  PHP5 Javascript CSS3 html5 Software  Photoshop Illustrator InDesign Bridge Dreamweaver Flash Responsible for all photography and photo editing on all products on www.sterexmedical.com Redesigned front-end for www.tristatesurgical.com Software  Photoshop Illustrator InDesign Bridge Dreamweaver Developed SEO criteria for site, including meta keywords and description. Language  PHP for developing specific keyword strings directed to specific products and their categories. Created an Excel keyword database on all products to be used as a reference. Software  Excel Responsible for adding and updating all 20,000 products online.    Print Work  Designed logos, brochures, flyers, and all packaging materials for print production following strict print  regulations on spot and process printing on tubes, bottles and bags. Software  Photoshop Illustrator InDesign Bridge August   2008     May   2010 Mississippi State University   Adjunct Professor Taught Introduction to Computing, Web Design, Multimedia using Flash, College ID, & Big Idea. Languages Taught  HTML PHP Javascript Developed two new Intro to Computing projects that are now taught at Keene State College & Louisiana Tech University. See Course descriptions below. April   2008     December   2009 Cre8tive Warehouse   Owner and Senior Designer   Developer Cofounded the Cre8tive Warehouse, a design studio gallery for the Starkville   MSU community. Maintained approximately 23 regional clients in web and print design. Managed all renting artists, providing materials and setting up exhibition dates. Planned, organized & hosted approximately 25 shows throughout the year. Senior Art Director for artist Holly Senter   s installation exhibition    God in the Safe & Ford on the shelves   . Starkville Arts Council member. Lead all pitch presentations to clients. Managed all finances. Classes Taught at SVA Having reviewed my experience with web development and the concepts of user interaction and interface design, SVA approached me to teach pharmaceutical marketing company, Sudler & Hennessey, the basics of web design from a user perspective. The class participants ranged from senior executives to junior frontend developers. Fall 2013 UX UI Fundamentals The focus of the course was to inform S&H employees of current user practices in regards to mobile web design and development, as well as instruct on the current wireframing techniques using Adobe Photoshop. The course ended with a scripting course on how design and development come together to build a working site. The overall goal was to equip participants with the knowledge and ability to design mockups and wireframes for a working responsive website. You can find the course outline at careyestesdesign.com class Classes taught at MSU The Mississippi State University Graphic Design program has won awards across the nation and maintains scholastic integrity through a very thorough portfolio review process. The program was deemed the    Gem of the South    by How magazine in August of 2009. I have taught thirteen class sections, and five individual studies over the course of two years as a lecturer. Spring 2010 College Identity College Identity is offered by-invitation-only to the most prominent graphic design students in the program. The class allows students to interact with real clients as if it were a graphic design firm. Students are responsible for concept, design, positioning marketing and layout. Students must show congruity in all aspects of the development process, and must deliver the appropriate collaterals at the end of the term, under the applied budget constraints. What   s the Big Idea The emphasis of this class is seeing the    Big Picture    in product service development, developing an identity for new idea, branding, marketing the company, service and the advertising, design of said idea. The students develop unique creative solutions to solve complex advertising problems and produce quality advertising campaigns. Students must develop skills for solving complete campaigns from product service, audience and client positioning, marketing and creative strategies to thumbnails, layouts and super comps. There will be creative team interaction and individual brainstorming and detailed research. Web Design The class teaches how to create websites that comply to W3C standards. Basic HTML and tables are covered, but mainly focuses on pure CSS-based web layouts. It promotes the understanding and theory of the web, including domain, hosting, and FTP management. The class also covers basic Javascript and PHP language. Introduction to Computing for Graphic Designers The class is based on teaching the fundamentals of the Adobe Creative Suite. It covers basic to advanced techniques in Illustrator, Photoshop, and InDesign. The class requires a minimum sophomore level. The class is also responsible for preparing student portfolios for the Graphic Design review held every fall semester. This critical review determines if the students are allowed to pursue their degree in the Graphic Design emphasis area. The class helps students gather and organize their portfolio to comply with submission rules, including photographing work properly, printing, and developing the outline and labels for the portfolio. Fall 2009 Introduction to Computing for Graphic Designers Web Design Multimedia The class teaches how to utilize Adobe Flash in a web environment. It covers animation techniques, Actionscript 3.0, and utilizing dynamic content to develop a strong web interface. Summer 2009 Introduction to Computing for Graphic Designers Individual study on developing a portfolio website for Fine Art majors This class taught students how to create a portfolio website using very little code, but allowing the website to be easily maintained and updated. The class used very visually oriented methods such as Wordpress, but also explained ways of exporting using Photoshop and InDesign. Spring 2009 Introduction to Computing for Graphic Designers Co-taught Electronic Visualization graduate class with Brent Funderburk The class was set up similar to a production studio pipeline for an animated film. The instructors played the role of producers that have final authority to invest in an animated full-length film. The students developed character and environmental conceptual art, as well as, story-boarded specific scenes with the goal to persuade the instructors the film was worth investment. The students were required to divvy up their work load to create a successful production stream and meet deadlines set by the instructors. The goal was to have students end the class with a conceptual portfolio that could be sent to animation studios. Fall 2008 Introduction to Computing for Graphic Designers Spring 2007 MSA graduate program class tutorials for Adobe Creative Suite The tutorials covered the basics of Illustrator and Photoshop. This allowed the students to create the required work from the program, which concluded in using Illustrator to create three-dimensional designs using a laser cutter and 3D printer. Teaching Accomplishments at MSU Responsible for the final print production of the CAAD Invitations for the Fine Arts Annual faculty show. Assisted with final print production of Peter Bain   s submission for the Fine Arts Annual Faculty Show. Created two assignments for Introduction to Computing for Graphic Designers that implemented an effective way to utilize Illustrator and Photoshop. Student Teacher Evaluation score  4.7 of 5.0. Exhibitions & Printed Media 2013     15   AiOP advertisement printed in Public Art Review magazine 2014   AiOP advertisement in Ordinary Magazine to promote the FREE festival 2014   Featured in insider.sva.edu as a working artist 2013   A working AiOP Soduku puzzle to promote the NUMBER festival 2012   AiOP page spread in Forecast Magazine for MODEL festival 2011   A Nasci Pinhole by Holly Senter 2010   Bank Book, a pop-up book by Maureen Connor 2009   The Everyman Designer at Pratt Manhattan 2009   Starkville Community Market Art Auction Fund Raiser 2008   Kill Your Superhero Awards 2014   Communicator Award for free.artinoddplaces.org 2013   Webby honoree for sva.edu 2013   Webby honoree for number.artinoddplaces.org 2009   Heroes of the Community     Mississippi Columbus Dispatch 2008   Video chosen as one of the top videos of the year by mtvbestvideoever.com 2007   Won National Logo Competition for national publication    Logo Lounge Book v.4    2006   Won logo design competition for Design America Center. 2006   Invited to participate in by-invitation-only College ID course at MSU. 2006   Branding identity design chosen and produced by College of Architecture, Art, + Design Public Service February 2011     Present Joined the team of Art in Odd Places as their graphic and web designer developer as a community service project. Using  Language  Wordpress, PHP5, Javascript, CSS3, HTML, Gulp   Grunt, npm Software  Photoshop, Illustrator, Bridge, Sublime Text April   2008     April 2010 Designed and maintained the Cre8tive Warehouse website. Using  Language  PHP5, Javascript, CSS3, HTML Software  Photoshop, Illustrator, Bridge, Dreamweaver, Flash Organizing and promoting all exhibition installation receptions held at the warehouse through newspaper, TV, and radio. Designing and printing of advertising collaterals for exhibitions and contests. Using  Software  Photoshop, Illustrator, Bridge, Dreamweaver, Flash May 2009 Created pro-bono branding identity for humanitarian organization Green Starkville. Using  Software  Photoshop, Illustrator, Assisted nationally recognized artist Brent Funderburk in developing an presentation for Walter Anderson entitled    Ecstasy     the Mystical Landscapes of Walter Anderson    which has been held at numerous schools across the Southeast. Using  Software  Powerpoint Web Clients artinoddplaces.org built on a Wordpress custom theme free.artinoddplaces.org built on a Wordpress custom theme number.artinoddplaces.org built on a Wordpress custom responsive theme brooklynbeans.com built on a Wordpress custom theme (responsive site coming soon) bellapbd.com built on a Wordpress custom theme cartney-hunthouse.com built on a Wordpress custom theme edwoodham.com built on a Wordpress custom responsive theme icrave.com built on a Wordpress theme (responsive design coming soon) prospecttea.com built on a Wordpress custom theme sterexmedical.com built on a flat php html structure thesouthernsocialvenue.com built on a Wordpress custom responsive theme tworiversco.com built on a Wordpress custom theme","link":"http:\/\/careyestes.local\/resume\/"},{"title":"AiOP","content":"Art in Odd Places ( AiOP ) is brilliant, dare I say majestic! AiOP is about breaking the mundane of everyday existence with a message of hope, creativity, responsibility or simply fun. AiOP has humble beginnings on 14th street in New York City, but has now expanded across the U.S. and internationally to include Russia and Australia. Working with AiOP has been one of the best experiences of my life. Since I joined in 2011, I have worked on the main AiOP site, which stays up for most of the year, as well as each yearly festival site which we launch around October and run it through the length of the festival in NYC. I have also setup microsites for each festival that is on-going throughout the year. 2014   FREE The Site Winner of a 2014 Communicator Award! free.artinoddplaces.org For the FREE site, I wanted to use Google maps to focus heavily on the mobile user. The concept was to design and develop a site with a clean interface and fast load time so the user could use their mobile device to navigate through the festival while it was happening in real time. With that in mind, I did something a bit out of my normal wheelhouse. I went with a    mobile-first    mentality. In the previous festival site NUMBER, I had a maps page full screen which showed each artist and a marker for the location and time. It received a significant amount of traffic so I decided to push that concept further. Rather than having a fullscreen image carousel (or some other beautification sizzle), I wanted the homepage to be the street. In FREE, the homepage lays out 14th street with markers for each artist. From here, the user can see each artist in each location, and with the pin description get an idea of the piece. Currently, this method was just a mirror from the maps page on NUMBER, so I wanted to push it even further. Many artists move throughout 14th street in their performance, and I wanted to render that in the map. Therefore, some artists have plot routes, which show their start and end points. While that it all fine and dandy, after going through the artist pieces and conversing with the stellar AiOP team, it seemed we could enhance this feature further. I created modals for each plot route as well, so the user could have more information about each piece in it   s current state. This feature is easily the one I am most proud of in the FREE site. Another feature of the FREE site is the ability to filter the artists by the date they will be performing. Some artists have static pieces which are up through the festival, but other pieces are more dynamic and only exist on certain days. In the previous NUMBER site, the calendar was a loop of each artist and the date and time of each performance. That needed to be tweaked to coincide with the map, so the user could filter properly while being on 14th street. The Calendar link in the nav slides in filtering option which removes each artist that does not have an active piece on the chosen date. To push this filtering option further, I used custom markers to show each artist category to facilitate the user. The legend at the top of the page will filter out only the category chosen. This helps show the different types of pieces happening on 14th street. The most important marker, from a usability standpoint, is the    Happening Now    marker. Currently, if you click it, you won   t see any markers. As so, the    Happening Now    marker was designed for users on the street during the festival. Users could click this marker during the festival and know where to go to see the artists that have current events. According to our user feedback, this option was the most useful throughout the festival! Considering the    mobile-first    strategy, I also wanted to use a fixed menu system, so the user could have access to different parts of the site on any given Y-position. While the fixed menu offers a few caveats, it served our users well during the festival. They could pull out the nav drawer and jump from one page to another seamlessly. We have included a Tumblr and Flickr feed on sites in the past, but incorporating into the Maps posed a new trial. Considering how dynamic the content would be, coming from two different sources from different API   s on the web, I chose to include a collapsible    sub-footer   . This allowed the user to expand and collapse this option according to it   s relevance. On mobile view, the map is the most important aspect, so the feeds are collapsed by default. However on desktop where there is a bit more real estate, this is exposed on initial load. The logic to control this on each viewport, in each state involved a good bit of JS logic. The experts at Stack Overflow were priceless when it came to undermining this task. I wanted to use a new way to find artists, as well. I incorporated Typeahead into the artist filter page to help users find artists easier, rather than just sorting by GET variable in a page. A completely superficial addition, but I like the way it intros the site is a page loading gif, which shows while the homepage is populating the markers from the database. Ok...last but not least, oneof my favorite additions to AiOP  FREE. I was coming up with spacing issues when thinking about how to layout the site in landscape mode on a small device. I eventually decided rather than build a poorly functioning example of the site in landscape mode, to restrict the user to portrait. So I created this gif for when users rotate their phone to landscape. Lazy? Yes. Funny? Yes. Funny  == Lazy any day. Funny is the paper to the lazy rock. Overall, the site was a success and we received nothing but positive feedback. We received a record breaking amount of site hits and kept a solid bounce ratio of 38% during the festival. Also, I fell softly in love with the Google Maps API during this project and look forward to how I can extend it even further in 2015. I   m looking at you AngularJS!   The Promo Video To promote the AiOP FREE festival, I created a promo video with the help of the curators Juliana Driever and Dylan Gauthier, along with our sound master Diane Brindle and as always the director Ed Woodham. The concept was to create this fast moving slideshow of images from 14th street, some being art pieces, while others being the normal mundane street ( although honestly what is mundane about 14th street amirite? ) appending some of the FREE text with the image. The following was the result  https   vimeo.com 99787515 I walked down 14th street with my iPad, taking photos video with a reference to FREE. FREE dry-cleaning, FREE soda, etc. I tried to focis on anything that stood out as NYC specific, but also embraced the ideology of FREE since the concept is as vast as it is finite. After putting together a rough loop of images and copy, Diane wrote this brilliant piece that played up the rhythm and texture we needed for the video. One of the greatest, I would say serendipitous parts is the cat growl in the piece. I recorded a squirrel in the park as filler thinking it would not amount to much in final production. However, when we laid down the bit of the scream against the video of the squirrel, it all made sense by not making any sense. It   s easily the best part of the video, considering the implications of a wild and crazy city, yet the wildest creature could be considered the squirrel  that will steal your lunch ( I am not considering rats   because rats do not need consideration ). 2013   NUMBER The Site 2013 Webby  Honoree number.artinoddplaces.org Number was the first AiOP festival site built in Wordpress. All previous versions I built from scratch in PHP. There was a very basic CMS in place for festival admins to update content, but I wanted to improve on it. For the Number layout, I wanted to use some big full-screen images as an opener to the festival, since we had not done that in the past. I wanted it to be much more about the photography of the artists, rather than text heavy explanations of the festival itself. I added a full-screen image slideshow and all festival info below. Starting with a note from the curator. It seemed to be a nice intro to the AiOP world. AiOP had never integrated Google Map functionality as a backbone to artist locations, so that was another priority for me. I had dabbled in G-Maps V3, but never really dug into it. First, I created a small map on the homepage and was very pleased with the look and functionality. So I decided to extend it to it s own page. It was a huge hit by analytics and user reaction standards, and in this the idea for the 2014 FREE festival sparked. Next up was the calendar. After an exhaustive search, I couldn t find a pre-built calendar that was stripped down but had my specific needs. So I decided to build my own. It s just a calendar...how hard could it be right? I learned a lot about calendars, time, turning strings to time, time to strings, then outputting date() formats, along with an in depth look at calendar logic (if date is greater than today, but less than a day three days from now, then do this...). There were moments I dumped it and started over. I am pretty sure I cried a few times. At one point, I decided the only real way to build it was to drink a lot of bourbon and it would work itself out. Eventually, it came together and it is one of my proudest developing moments. While it may not seem like much, it was mine. I built it from scratch and it practically became a family member. Hello, I m Carey and this is Amberjack...my simple calendar. By the time Number rolled around, Ed was confident in me taking some liberties with the site design. He trusts  me to conceptualize and build out my vision for the site, while he, and the curators support me with great enthusiasm and constructive criticism.   With their support, I decided to redesign Number from the previous template. It was looking a bit junior varsity in my opinion. I decided to use strong diagonal lines and sharp geometric containers to work in tandem with the Number concept. I used a strong, rich black which connects it with the AiOP main site, along with the type set in a black rectangle. Number is also AiOP s first fully responsive layout. It seemed 2013 was the year for responsive, and what better site to be mobile friendly than AiOP? I had been working with responsive just a bit when I tackled this one, so there are many issues I would like to address, but overall it works well on all viewports. ...and the icing. My favorite piece was the last little addition. I wrote a random number generator script, which would flip through numbers and ultimately change to NUMBER. I applied it to the header of the homepage. The script works in a couple of random ways. It randomly sorts through integers ","link":"http:\/\/careyestes.local\/aiop\/"},{"title":"iCrave","content":"iCrave is a NYC based design firm that makes some rawkin design! I worked with Eric Corriel with the design and development of this project. Since it s relaunch in 2013, I have worked with iCrave to design the best UI UX experience, including fancy shortcodes for the blog and making the once fixed width design, responsive. The home page is using isotope and masonry to tile the grid, as well as filter selections by category type. ","link":"http:\/\/careyestes.local\/icrave\/"},{"title":"The Southern","content":"Southen info","link":"http:\/\/careyestes.local\/the-southern\/"},{"title":"Prospect Tea","content":"Prospect Tea descrip","link":"http:\/\/careyestes.local\/prospect-tea\/"}]